DemoFormApllication/app/controllers/users_controller.rb

	def new
		@user = User.new
		@users = User.all
---
SELECT "users".* FROM "users"

	def create
		@user = User.new(params[:user].permit(:name,:review))
		if @user.save
			respond_to do |format|
				format.html { render :json => User.all }
---
INSERT INTO "users" ("created_at", "name", "review", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-19 20:33:02.238252"], ["name", "orel"], ["review", "jksdflkjahf"], ["updated_at", "2014-11-19 20:33:02.238252"]]
SELECT "users".* FROM "users"